# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [5]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names = baby_names.loc[:,'Name':'Count']

In [6]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [9]:
baby_names.Gender.value_counts().to_frame()

         count
Gender
F       558846
M       457549

### Step 7. Group the dataset by name and assign to names

In [28]:
names = baby_names.groupby(['Name'])

In [29]:
names.head()

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1004923  Gryffin  2014      M    WI      5
1004950     Kroy  2014      M    WI      5
1004973     Owyn  2014      M    WI      5
1005707   Haylea  2005      F    WV      5
1012216  Coalton  2012      M    WV      7

[65502 rows x 5 columns]

### Step 8. How many different names exist in the dataset?

In [34]:
baby_names.Name.unique().size

17632

### Step 9. What is the name with most occurrences?

In [43]:
name_occurrences = baby_names.groupby(['Name'])['Name'].value_counts().to_frame()

In [46]:
name_occurrences.idxmax()

count    Riley
dtype: object

### Step 10. How many different names have the least occurrences?

In [53]:
name_occurrences=name_occurrences.sort_values(by='count')
name_occurrences

           count
Name
Katherina      1
Breyona        1
Greidy         1
Shriyan        1
Briah          1
...          ...
Hayden      1049
Peyton      1064
Jordan      1073
Avery       1080
Riley       1112

[17632 rows x 1 columns]

In [58]:
name_occurrences[name_occurrences['count']==1].shape[0]

3682

### Step 11. What is the median name occurrence?

In [77]:
median = int(name_occurrences['count'].median())

name_occurrences[name_occurrences['count']==median]

           count
Name
Kaio           8
Kaileen        8
Katelynne      8
Kenzlie        8
Zakia          8
...          ...
Tovia          8
Amyri          8
Ambree         8
Jamaree        8
Lukasz         8

[360 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [65]:
name_occurrences.std()

count    122.029964
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [64]:
name_occurrences.describe()

              count
count  17632.000000
mean      57.644907
std      122.029964
min        1.000000
25%        2.000000
50%        8.000000
75%       39.000000
max     1112.000000